DataProcessors/LN_МСРИнструментАдмин.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>LN_МСРИнструментАдмин</Name>
			<Comment>Контейнер tools: get_event_log, get_access_rights</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/LN_МСРНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>LN_МСРНастройки</Name>
			<Comment>Серверные настройки LN_MCP_1C (формат ответа, лимиты токенов, режим execute_code, и т.п.)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/LN_МСРИнструментАдмин/Ext/ManagerModule.bsl
//LN++ ManagerModule обработки LN_МСРИнструментАдмин
// Tools:
//   - get_event_log         — выгрузка журнала регистрации (мульти-фильтры + cursor)
//   - get_last_error        — последняя ошибка из ЖР одной короткой структурой (шорткат)
//   - get_access_rights     — проверка прав текущего/указанного пользователя на объект МД
//   - get_setting           — чтение значения из РегистрСведений.LN_МСРНастройки по ключу
//   - set_setting           — запись/обновление значения в РегистрСведений.LN_МСРНастройки
//

Процедура ДобавитьИнструменты(Инструменты) Экспорт

	ДобавитьGetEventLog(Инструменты);
	ДобавитьGetLastError(Инструменты);
	ДобавитьGetAccessRights(Инструменты);
	ДобавитьGetSetting(Инструменты);
	ДобавитьSetSetting(Инструменты);
	ДобавитьSamplingTools(Инструменты);

КонецПроцедуры

Функция ВыполнитьИнструмент(ИмяИнструмента, Аргументы) Экспорт

	Если ИмяИнструмента = "get_event_log" Тогда
		Возврат ВыполнитьGetEventLog(Аргументы);
	ИначеЕсли ИмяИнструмента = "get_last_error" Тогда
		Возврат ВыполнитьGetLastError(Аргументы);
	ИначеЕсли ИмяИнструмента = "get_access_rights" Тогда
		Возврат ВыполнитьGetAccessRights(Аргументы);
	ИначеЕсли ИмяИнструмента = "get_setting" Тогда
		Возврат ВыполнитьGetSetting(Аргументы);
	ИначеЕсли ИмяИнструмента = "set_setting" Тогда
		Возврат ВыполнитьSetSetting(Аргументы);
	ИначеЕсли ИмяИнструмента = "request_sampling" Тогда
		Возврат ВыполнитьRequestSampling(Аргументы);
	ИначеЕсли ИмяИнструмента = "pull_pending_sampling" Тогда
		Возврат ВыполнитьPullPendingSampling(Аргументы);
	ИначеЕсли ИмяИнструмента = "submit_sampling_result" Тогда
		Возврат ВыполнитьSubmitSamplingResult(Аргументы);
	ИначеЕсли ИмяИнструмента = "get_sampling_result" Тогда
		Возврат ВыполнитьGetSamplingResult(Аргументы);
	Иначе
		ВызватьИсключение "Неизвестный инструмент: " + ИмяИнструмента;
	КонецЕсли;

КонецФункции

#Область sampling

Процедура ДобавитьSamplingTools(Инструменты)

	// request_sampling — server-side инициированный запрос на сэмплинг.
	Параметры = Новый Массив;
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("messages", "array",
		"Массив сообщений {role, content} для LLM (MCP-формат). Минимум одно сообщение user.", , Истина));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("system_prompt", "string",
		"Опц.: системный prompt", , Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("max_tokens", "number",
		"Опц.: лимит токенов ответа LLM", , Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("model_preferences", "object",
		"Опц.: подсказки клиенту, какую LLM использовать (hints, costPriority, speedPriority, intelligencePriority).",
		, Ложь));
	mcp_Метаданные.ДобавитьИнструмент(Инструменты, "request_sampling",
		"Создаёт запрос на сэмплинг (LLM call) в очередь LN_МСРОчередьСэмплинга."
			+ " Возвращает sample_id; клиент-агент должен опросить pull_pending_sampling, выполнить LLM-вызов"
			+ " и вернуть submit_sampling_result. Результат забирается через get_sampling_result.",
		mcp_Метаданные.СхемаПараметровИнструмента(Параметры));

	// pull_pending_sampling
	Параметры = Новый Массив;
	mcp_Метаданные.ДобавитьИнструмент(Инструменты, "pull_pending_sampling",
		"Забирает следующий pending-запрос из очереди (FIFO). Переводит его в статус in_progress."
			+ " Возвращает sample_id и payload (messages, system_prompt и т.д.). Если очередь пуста — found=false.",
		mcp_Метаданные.СхемаПараметровИнструмента(Параметры));

	// submit_sampling_result
	Параметры = Новый Массив;
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("sample_id", "string", "ID запроса (из pull_pending_sampling)", , Истина));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("content", "object",
		"Содержимое ответа LLM (MCP-формат: { role: 'assistant', content: { type: 'text', text: '...' }, model: '...', stopReason: '...' }).",
		, Истина));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("error", "string",
		"Если LLM упал — текст ошибки. Тогда статус будет failed.", , Ложь));
	mcp_Метаданные.ДобавитьИнструмент(Инструменты, "submit_sampling_result",
		"Возвращает результат LLM-сэмплинга в очередь. Статус переходит в completed или failed.",
		mcp_Метаданные.СхемаПараметровИнструмента(Параметры));

	// get_sampling_result
	Параметры = Новый Массив;
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("sample_id", "string", "ID запроса", , Истина));
	mcp_Метаданные.ДобавитьИнструмент(Инструменты, "get_sampling_result",
		"Возвращает текущее состояние sample_id: { status:'pending|in_progress|completed|failed', content, error }.",
		mcp_Метаданные.СхемаПараметровИнструмента(Параметры));

КонецПроцедуры

Функция ВыполнитьRequestSampling(Аргументы)
	Полезное = Новый Структура;
	Если Аргументы.Свойство("messages") Тогда
		Полезное.Вставить("messages", Аргументы.messages);
	Иначе
		ВызватьИсключение "messages обязателен";
	КонецЕсли;
	Если Аргументы.Свойство("system_prompt") Тогда Полезное.Вставить("system_prompt", Аргументы.system_prompt); КонецЕсли;
	Если Аргументы.Свойство("max_tokens") Тогда Полезное.Вставить("max_tokens", Аргументы.max_tokens); КонецЕсли;
	Если Аргументы.Свойство("model_preferences") Тогда Полезное.Вставить("model_preferences", Аргументы.model_preferences); КонецЕсли;
	Идентификатор = LN_МСРСэмплинг.СоздатьЗапрос(Полезное);
	Возврат Новый Структура("sample_id, status", Идентификатор, "pending");
КонецФункции

Функция ВыполнитьPullPendingSampling(Аргументы)
	Заявка = LN_МСРСэмплинг.ЗабратьСледующий();
	Если Заявка = Неопределено Тогда
		Возврат Новый Структура("found", Ложь);
	КонецЕсли;
	Возврат Новый Структура("found, sample_id, payload, created_at",
		Истина, Заявка.sample_id, Заявка.payload, Заявка.created_at);
КонецФункции

Функция ВыполнитьSubmitSamplingResult(Аргументы)
	Идентификатор = ?(Аргументы.Свойство("sample_id"), СокрЛП(Строка(Аргументы.sample_id)), "");
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда ВызватьИсключение "sample_id обязателен"; КонецЕсли;
	Содержимое = ?(Аргументы.Свойство("content"), Аргументы.content, Неопределено);
	Ошибка = ?(Аргументы.Свойство("error"), Строка(Аргументы.error), "");
	LN_МСРСэмплинг.ЗавершитьЗапрос(Идентификатор, Содержимое, Ошибка);
	Возврат Новый Структура("submitted, sample_id, status",
		Истина, Идентификатор, ?(ЗначениеЗаполнено(Ошибка), "failed", "completed"));
КонецФункции

Функция ВыполнитьGetSamplingResult(Аргументы)
	Идентификатор = ?(Аргументы.Свойство("sample_id"), СокрЛП(Строка(Аргументы.sample_id)), "");
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда ВызватьИсключение "sample_id обязателен"; КонецЕсли;
	Состояние = LN_МСРСэмплинг.Прочитать(Идентификатор);
	Если Состояние = Неопределено Тогда
		Возврат Новый Структура("found, sample_id", Ложь, Идентификатор);
	КонецЕсли;
	Возврат Новый Структура("found, sample_id, status, content, error, created_at, updated_at",
		Истина, Состояние.sample_id, Состояние.status, Состояние.content, Состояние.error,
		Состояние.created_at, Состояние.updated_at);
КонецФункции

#КонецОбласти

#Область get_last_error

Процедура ДобавитьGetLastError(Инструменты)

	Параметры = Новый Массив;
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"hours", "number",
		"За сколько последних часов искать ошибку (по умолчанию 24). Максимум — 24*30.",
		24));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"event_substring", "string",
		"Опц.: подстрока в имени события. Полезно, чтобы взять последнюю ошибку конкретной подсистемы.",
		, Ложь));

	mcp_Метаданные.ДобавитьИнструмент(
		Инструменты,
		"get_last_error",
		"Возвращает последнюю ошибку из журнала регистрации компактной структурой"
			+ " {date, event, metadata, data, comment}. Шорткат поверх get_event_log для типового"
			+ " запроса агента «расскажи что упало».",
		mcp_Метаданные.СхемаПараметровИнструмента(Параметры));

КонецПроцедуры

Функция ВыполнитьGetLastError(Аргументы)

	Часов = ?(Аргументы.Свойство("hours"), Число(Аргументы.hours), 24);
	Если Часов <= 0 Тогда Часов = 24; КонецЕсли;
	Если Часов > 24 * 30 Тогда Часов = 24 * 30; КонецЕсли;

	Отбор = Новый Структура;
	Отбор.Вставить("ДатаНачала", ТекущаяДатаСеанса() - Часов * 3600);
	Отбор.Вставить("Уровень", УровеньЖурналаРегистрации.Ошибка);
	Если Аргументы.Свойство("event_substring") И ЗначениеЗаполнено(Аргументы.event_substring) Тогда
		Отбор.Вставить("Событие", Аргументы.event_substring);
	КонецЕсли;

	Колонки = "Дата,Уровень,Событие,ПредставлениеСобытия,ПредставлениеМетаданных,ПредставлениеДанных,Комментарий";
	Записи = Новый ТаблицаЗначений;
	ВыгрузитьЖурналРегистрации(Записи, Отбор, Колонки, , 1);

	Если Записи.Количество() = 0 Тогда
		Возврат Новый Структура("found, message", Ложь, "За указанный период ошибок не найдено");
	КонецЕсли;
	Стр = Записи[0];
	Возврат Новый Структура(
		"found, date, event, event_presentation, metadata, data, comment",
		Истина,
		Стр.Дата,
		Стр.Событие,
		Стр.ПредставлениеСобытия,
		Стр.ПредставлениеМетаданных,
		Стр.ПредставлениеДанных,
		LN_МСРКодирование.ОбрезатьСтроку(Стр.Комментарий, 2000));

КонецФункции

#КонецОбласти

#Область get_setting_set_setting

Процедура ДобавитьGetSetting(Инструменты)

	Параметры = Новый Массив;
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"key", "string",
		"Ключ настройки. Стандартные ключи: execute_code_default_safe, audit_enabled, cache_ttl_seconds, "
			+ "max_response_chars, default_response_format.",
		, Истина));
	mcp_Метаданные.ДобавитьИнструмент(
		Инструменты,
		"get_setting",
		"Читает значение настройки из РегистрСведений.LN_МСРНастройки по ключу."
			+ " Возвращает {key, value, found}.",
		mcp_Метаданные.СхемаПараметровИнструмента(Параметры));

КонецПроцедуры

Процедура ДобавитьSetSetting(Инструменты)

	Параметры = Новый Массив;
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"key", "string", "Ключ настройки", , Истина));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"value", "string", "Значение настройки (строкой; для булевых: true/false)", , Истина));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"description", "string", "Опциональное описание настройки", , Ложь));
	mcp_Метаданные.ДобавитьИнструмент(
		Инструменты,
		"set_setting",
		"Записывает/обновляет настройку в РегистрСведений.LN_МСРНастройки."
			+ " Транзакционно. Возвращает {key, value, updated}.",
		mcp_Метаданные.СхемаПараметровИнструмента(Параметры));

КонецПроцедуры

Функция ВыполнитьGetSetting(Аргументы)
	Ключ = ?(Аргументы.Свойство("key"), Аргументы.key, "");
	Если НЕ ЗначениеЗаполнено(Ключ) Тогда ВызватьИсключение "Параметр key обязателен"; КонецЕсли;
	Запрос = Новый Запрос(
		"ВЫБРАТЬ Значение, Комментарий ИЗ РегистрСведений.LN_МСРНастройки ГДЕ Ключ = &Ключ");
	Запрос.УстановитьПараметр("Ключ", Ключ);
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Новый Структура("key, value, description, found", Ключ, "", "", Ложь);
	Если Выборка.Следующий() Тогда
		Результат.value = Выборка.Значение;
		Результат.description = Выборка.Комментарий;
		Результат.found = Истина;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ВыполнитьSetSetting(Аргументы)
	Ключ = ?(Аргументы.Свойство("key"), Аргументы.key, "");
	Значение = ?(Аргументы.Свойство("value"), Строка(Аргументы.value), "");
	Описание = ?(Аргументы.Свойство("description"), Строка(Аргументы.description), "");
	Если НЕ ЗначениеЗаполнено(Ключ) Тогда ВызватьИсключение "Параметр key обязателен"; КонецЕсли;
	НаборЗаписей = РегистрыСведений.LN_МСРНастройки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ключ.Установить(Ключ);
	Запись = НаборЗаписей.Добавить();
	Запись.Ключ = Ключ;
	Запись.Значение = Значение;
	Запись.Комментарий = Описание;
	НаборЗаписей.Записать();
	Возврат Новый Структура("key, value, updated", Ключ, Значение, Истина);
КонецФункции

#КонецОбласти

#Область get_event_log

Процедура ДобавитьGetEventLog(Инструменты)

	Параметры = Новый Массив;
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"start_date", "string", "Начальная дата (yyyy-MM-ddTHH:mm:ss)", , Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"end_date", "string", "Конечная дата (yyyy-MM-ddTHH:mm:ss)", , Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструментаМассив(
		"levels", "string",
		"Массив уровней: Info | Warning | Error | Note (либо русские аналоги).",
		Ложь, "Info,Warning,Error,Note"));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструментаМассив(
		"events", "string", "Массив имён событий (например MCP.tool.execute_query.Ошибка).", Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструментаМассив(
		"metadata_types", "string", "Полные имена МД для фильтра (Справочник.X, Документ.Y).", Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструментаМассив(
		"users", "string", "Массив имён пользователей или их UUID.", Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"computer", "string", "Имя компьютера (точное совпадение).", , Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"comment_substring", "string", "Подстрока в комментарии (нативный фильтр платформы).", , Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"transaction_status", "string",
		"Статус транзакции: Committed | RolledBack | NotApplicable | Unfinished.",
		, Ложь,
		"Committed,RolledBack,NotApplicable,Unfinished"));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"page_size", "number", "Размер страницы (по умолчанию 100, потолок 1000).", 100));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"cursor", "string",
		"Base64-курсор следующей страницы (поле next_cursor из предыдущего ответа). Пусто — первая страница.",
		, Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"max_items", "number",
		"DEPRECATED: используйте page_size. Если задан — переопределяет page_size.", , Ложь));

	mcp_Метаданные.ДобавитьИнструмент(
		Инструменты,
		"get_event_log",
		"Выгружает журнал регистрации с курсорной пагинацией (без пропусков и дублей в пределах одной секунды)."
			+ " Возвращает entries, count, has_more, next_cursor. Поддерживает мульти-фильтры (массивы) по уровню/"
			+ "событию/МД/пользователям, точное совпадение по компьютеру, подстроку в комментарии и статус транзакции.",
		mcp_Метаданные.СхемаПараметровИнструмента(Параметры));

КонецПроцедуры

Функция ВыполнитьGetEventLog(Аргументы)

	Отбор = Новый Структура;

	// Парсим курсор
	КурсорLastDate = '00010101';
	КурсорOffset = 0;
	Если Аргументы.Свойство("cursor") И ЗначениеЗаполнено(Аргументы.cursor) Тогда
		ДекодКурсор = ДекодироватьКурсор(Аргументы.cursor);
		Если ДекодКурсор <> Неопределено Тогда
			Если ДекодКурсор.Свойство("last_date") Тогда
				КурсорLastDate = РазобратьДату(ДекодКурсор.last_date);
			КонецЕсли;
			Если ДекодКурсор.Свойство("offset_in_second") Тогда
				КурсорOffset = Макс(0, Цел(ДекодКурсор.offset_in_second));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(КурсорLastDate) Тогда
		Отбор.Вставить("ДатаНачала", КурсорLastDate);
	ИначеЕсли Аргументы.Свойство("start_date") И ЗначениеЗаполнено(Аргументы.start_date) Тогда
		Отбор.Вставить("ДатаНачала", РазобратьДату(Аргументы.start_date));
	КонецЕсли;
	Если Аргументы.Свойство("end_date") И ЗначениеЗаполнено(Аргументы.end_date) Тогда
		Отбор.Вставить("ДатаОкончания", РазобратьДату(Аргументы.end_date));
	КонецЕсли;

	// Уровни (массив)
	Если Аргументы.Свойство("levels") И ТипЗнч(Аргументы.levels) = Тип("Массив") Тогда
		МассивУровней = Новый Массив;
		Для Каждого УровеньСтрока Из Аргументы.levels Цикл
			Ур = ПривестиУровень(УровеньСтрока);
			Если Ур <> Неопределено Тогда
				МассивУровней.Добавить(Ур);
			КонецЕсли;
		КонецЦикла;
		Если МассивУровней.Количество() > 0 Тогда
			Отбор.Вставить("Уровень", МассивУровней);
		КонецЕсли;
	КонецЕсли;

	// События
	Если Аргументы.Свойство("events") И ТипЗнч(Аргументы.events) = Тип("Массив")
		И Аргументы.events.Количество() > 0 Тогда
		Отбор.Вставить("Событие", Аргументы.events);
	КонецЕсли;

	// Метаданные
	Если Аргументы.Свойство("metadata_types") И ТипЗнч(Аргументы.metadata_types) = Тип("Массив") Тогда
		МассивМД = Новый Массив;
		Для Каждого ИмяМД Из Аргументы.metadata_types Цикл
			ОбъектМД = Метаданные.НайтиПоПолномуИмени(ИмяМД);
			Если ОбъектМД <> Неопределено Тогда
				МассивМД.Добавить(ОбъектМД);
			КонецЕсли;
		КонецЦикла;
		Если МассивМД.Количество() > 0 Тогда
			Отбор.Вставить("Метаданные", МассивМД);
		КонецЕсли;
	КонецЕсли;

	// Пользователи (имя или UUID)
	Если Аргументы.Свойство("users") И ТипЗнч(Аргументы.users) = Тип("Массив") Тогда
		МассивПользователей = НормализоватьСписокПользователей(Аргументы.users);
		Если МассивПользователей.Количество() > 0 Тогда
			Отбор.Вставить("Пользователь", МассивПользователей);
		КонецЕсли;
	КонецЕсли;

	Если Аргументы.Свойство("computer") И ЗначениеЗаполнено(Аргументы.computer) Тогда
		Отбор.Вставить("Компьютер", Аргументы.computer);
	КонецЕсли;

	Если Аргументы.Свойство("comment_substring") И ЗначениеЗаполнено(Аргументы.comment_substring) Тогда
		Отбор.Вставить("Комментарий", Аргументы.comment_substring);
	КонецЕсли;

	// Статус транзакции
	Если Аргументы.Свойство("transaction_status") И ЗначениеЗаполнено(Аргументы.transaction_status) Тогда
		СтатусЗначение = ПривестиСтатусТранзакции(Аргументы.transaction_status);
		Если СтатусЗначение <> Неопределено Тогда
			МассивСтатусов = Новый Массив;
			МассивСтатусов.Добавить(СтатусЗначение);
			Отбор.Вставить("СтатусТранзакции", МассивСтатусов);
		КонецЕсли;
	КонецЕсли;

	РазмерСтраницы = ?(Аргументы.Свойство("page_size"), Аргументы.page_size, 100);
	Если Аргументы.Свойство("max_items") И ЗначениеЗаполнено(Аргументы.max_items) Тогда
		РазмерСтраницы = Аргументы.max_items;
	КонецЕсли;
	Если РазмерСтраницы <= 0 Тогда РазмерСтраницы = 100; КонецЕсли;
	Если РазмерСтраницы > 1000 Тогда РазмерСтраницы = 1000; КонецЕсли;

	// Курсорная пагинация (паттерн ROCTUP):
	// выгружаем РазмерСтраницы + КурсорOffset + 1 записей (для определения has_more),
	// сортируем с tie-breakers, пропускаем КурсорOffset записей с датой == КурсорLastDate,
	// берём РазмерСтраницы следующих, считаем has_more, формируем next_cursor.
	ЛимитВыгрузки = РазмерСтраницы + КурсорOffset + 1;

	Записи = Новый ТаблицаЗначений;
	ВыгрузитьЖурналРегистрации(Записи, Отбор, , , ЛимитВыгрузки);
	Записи.Сортировать("Дата, Сеанс, Событие, Пользователь, ПредставлениеМетаданных, ПредставлениеДанных");

	Результат = Новый Массив;
	Пропущено = 0;
	Взято = 0;
	ПоследняяДатаОтданная = '00010101';
	Для Каждого Стр Из Записи Цикл
		// Пропускаем уже отданные записи с КурсорLastDate
		Если Пропущено < КурсорOffset И Стр.Дата = КурсорLastDate Тогда
			Пропущено = Пропущено + 1;
			Продолжить;
		КонецЕсли;
		Если Взято >= РазмерСтраницы Тогда
			Прервать;
		КонецЕсли;
		Запись = Новый Структура;
		Запись.Вставить("date",                 Стр.Дата);
		Запись.Вставить("level",                Строка(Стр.Уровень));
		Запись.Вставить("event",                Стр.Событие);
		Запись.Вставить("event_presentation",   Стр.ПредставлениеСобытия);
		Запись.Вставить("user",                 Строка(Стр.Пользователь));
		Запись.Вставить("user_name",            Стр.ИмяПользователя);
		Запись.Вставить("computer",             Стр.Компьютер);
		Запись.Вставить("application",          Стр.ИмяПриложения);
		Запись.Вставить("session",              Стр.Сеанс);
		Запись.Вставить("connection",           Стр.Соединение);
		Запись.Вставить("metadata",             Стр.ПредставлениеМетаданных);
		Запись.Вставить("data",                 Стр.ПредставлениеДанных);
		Запись.Вставить("transaction_status",   Строка(Стр.СтатусТранзакции));
		Запись.Вставить("comment",              LN_МСРКодирование.ОбрезатьСтроку(Стр.Комментарий, 1000));
		Результат.Добавить(Запись);
		ПоследняяДатаОтданная = Стр.Дата;
		Взято = Взято + 1;
	КонецЦикла;

	HasMore = (Записи.Количество() > Пропущено + Взято);

	NextCursor = "";
	Если HasMore И Результат.Количество() > 0 Тогда
		// Считаем, сколько записей с датой ПоследняяДатаОтданная уже отдано суммарно
		ВсегоОтданоВPosledней = 0;
		Если ПоследняяДатаОтданная = КурсорLastDate Тогда
			ВсегоОтданоВPosledней = КурсорOffset; // те, что пропустили в начале
		КонецЕсли;
		Для Каждого ЗапЛП Из Результат Цикл
			Если ЗапЛП.date = ПоследняяДатаОтданная Тогда
				ВсегоОтданоВPosledней = ВсегоОтданоВPosledней + 1;
			КонецЕсли;
		КонецЦикла;
		NextCursor = ЗакодироватьКурсор(ПоследняяДатаОтданная, ВсегоОтданоВPosledней);
	КонецЕсли;

	Возврат Новый Структура("entries, count, has_more, next_cursor",
		Результат, Результат.Количество(), HasMore, NextCursor);

КонецФункции

Функция ЗакодироватьКурсор(LastDate, OffsetInSecond)
	JSONТекст = СтрШаблон(
		"{""last_date"":""%1"",""offset_in_second"":%2}",
		XMLСтрока(LastDate),
		Формат(OffsetInSecond, "ЧДЦ=0; ЧГ=0"));
	Возврат Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(JSONТекст, "UTF-8", Ложь));
КонецФункции

Функция ДекодироватьКурсор(Курсор)
	Попытка
		Двоичные = Base64Значение(Курсор);
		JSONТекст = ПолучитьСтрокуИзДвоичныхДанных(Двоичные, "UTF-8");
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(JSONТекст);
		Возврат ПрочитатьJSON(ЧтениеJSON, Истина);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

Функция РазобратьДату(Текст)
	Попытка
		Возврат XMLЗначение(Тип("Дата"), Текст);
	Исключение
		Возврат '00010101';
	КонецПопытки;
КонецФункции

Функция ПривестиУровень(Текст)
	Т = ВРег(СокрЛП(Строка(Текст)));
	Если Т = "INFO"        Или Т = "INFORMATION"  Или Т = "ИНФОРМАЦИЯ"     Тогда Возврат УровеньЖурналаРегистрации.Информация;       КонецЕсли;
	Если Т = "WARNING"     Или Т = "ПРЕДУПРЕЖДЕНИЕ"                       Тогда Возврат УровеньЖурналаРегистрации.Предупреждение;   КонецЕсли;
	Если Т = "ERROR"       Или Т = "ОШИБКА"                                Тогда Возврат УровеньЖурналаРегистрации.Ошибка;          КонецЕсли;
	Если Т = "NOTE"        Или Т = "ПРИМЕЧАНИЕ"                            Тогда Возврат УровеньЖурналаРегистрации.Примечание;      КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ПривестиСтатусТранзакции(Текст)
	Т = ВРег(СокрЛП(Строка(Текст)));
	Если Т = "COMMITTED"      Тогда Возврат СтатусТранзакцииЗаписиЖурналаРегистрации.Зафиксирована; КонецЕсли;
	Если Т = "ROLLEDBACK"     Тогда Возврат СтатусТранзакцииЗаписиЖурналаРегистрации.Отменена;     КонецЕсли;
	Если Т = "NOTAPPLICABLE"  Тогда Возврат СтатусТранзакцииЗаписиЖурналаРегистрации.НетТранзакции; КонецЕсли;
	Если Т = "UNFINISHED"     Тогда Возврат СтатусТранзакцииЗаписиЖурналаРегистрации.НеЗавершена;   КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция НормализоватьСписокПользователей(СписокПользователей)

	Результат = Новый Массив;
	Для Каждого ИмяПользователя Из СписокПользователей Цикл
		Значение = СокрЛП(Строка(ИмяПользователя));
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Продолжить;
		КонецЕсли;
		ПользовательИБ = Неопределено;
		Если СтрДлина(Значение) = 36
			И Сред(Значение, 9, 1) = "-" И Сред(Значение, 14, 1) = "-"
			И Сред(Значение, 19, 1) = "-" И Сред(Значение, 24, 1) = "-" Тогда
			Попытка
				ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
					Новый УникальныйИдентификатор(Значение));
			Исключение
			КонецПопытки;
		КонецЕсли;
		Если ПользовательИБ = Неопределено Тогда
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Значение);
		КонецЕсли;
		Если ПользовательИБ <> Неопределено Тогда
			Результат.Добавить(ПользовательИБ);
		Иначе
			Результат.Добавить(Значение);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область get_access_rights

Процедура ДобавитьGetAccessRights(Инструменты)

	Параметры = Новый Массив;
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"object_name", "string", "Полное имя объекта МД (например ""Справочник.Контрагенты"")", , Истина));

	mcp_Метаданные.ДобавитьИнструмент(
		Инструменты,
		"get_access_rights",
		"Возвращает структуру прав текущего пользователя на объект МД: чтение, добавление, изменение, удаление, "
			+ "проведение, отмена проведения, интерактивное чтение и т.д.",
		mcp_Метаданные.СхемаПараметровИнструмента(Параметры));

КонецПроцедуры

Функция ВыполнитьGetAccessRights(Аргументы)

	ИмяОбъекта = ?(Аргументы.Свойство("object_name"), Аргументы.object_name, "");
	Если НЕ ЗначениеЗаполнено(ИмяОбъекта) Тогда
		ВызватьИсключение "Параметр object_name обязателен";
	КонецЕсли;

	МД = Метаданные.НайтиПоПолномуИмени(ИмяОбъекта);
	Если МД = Неопределено Тогда
		ВызватьИсключение "Объект метаданных не найден: " + ИмяОбъекта;
	КонецЕсли;

	Права = "Чтение,Добавление,Изменение,Удаление,Проведение,ОтменаПроведения,"
		+ "ИнтерактивноеЧтение,ИнтерактивноеДобавление,ИнтерактивноеИзменение,ИнтерактивноеУдаление,"
		+ "Просмотр,Редактирование,ВводПоСтроке";

	Результат = Новый Структура;
	Результат.Вставить("object", МД.ПолноеИмя());
	Результат.Вставить("user", Строка(ПользователиИнформационнойБазы.ТекущийПользователь()));

	Доступы = Новый Структура;
	Для Каждого Право Из СтрРазделить(Права, ",", Ложь) Цикл
		Попытка
			Доступы.Вставить(СокрЛП(Право), ПравоДоступа(СокрЛП(Право), МД));
		Исключение
			// Право может не применяться к данному типу — пропускаем тихо
		КонецПопытки;
	КонецЦикла;
	Результат.Вставить("rights", Доступы);

	Возврат Результат;

КонецФункции

#КонецОбласти
